package com.javarush.test.level36.lesson08.bonus01;

/* Разбираемся в красно-черном дереве
Дана реализация красно-черного дерева.
Некоторые методы сломаны. Разберитесь в коде и исправьте ошибки.
Метод main не участвует в тестировании.
Все модификатры правильные.
Имена переменных и методов не изменяйте.
*/
public class Solution
{
    public static void main(String[] args)
    {
//        RedBlackTree t = new RedBlackTree();
//        final int NUMS = 40000;
//        final int GAP = 307;
//
//        System.out.println("Checking... (no more output means success)");
//
//        for (int i = GAP; i != 0; i = (i + GAP) % NUMS)
//            t.insert(i);
//
//        if (NUMS < 40)
//            t.printTree();
//        if (((MyInteger) (t.findMin())).intValue() != 1 ||
//                ((MyInteger) (t.findMax())).intValue() != NUMS - 1)
//            System.out.println("FindMin or FindMax error!");
//
//        for (int i = 1; i < NUMS; i++)
//            if (((MyInteger) (t.find(new MyInteger(i)))).intValue() != i)
//                System.out.println("Find error1!");

    }
}
